app/controllers/admin/staff_members_controller.rb

  def create
    @staff_member = StaffMember.new(staff_member_params)
    if @staff_member.save
---
INSERT INTO `staff_members` (`created_at`, `email`, `email_for_index`, `family_name`, `family_name_kana`, `given_name`, `given_name_kana`, `hashed_password`, `start_date`, `updated_at`) VALUES ('2014-12-14 08:28:46', 'member1@example.com', 'member1@example.com', '山田', 'ヤマダ', '太郎', 'タロウ', '$2a$10$ettetpd.BRvle0yWmolEI.ZH/UEFulfDE/coX//3qWm0ulKc97y56', '2014-12-13', '2014-12-14 08:28:46')

  def update
    @staff_member = StaffMember.find(params[:id])
    @staff_member.assign_attributes(staff_member_params)
    if @staff_member.save
---
SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`id` = 2 LIMIT 1
UPDATE `staff_members` SET `email` = 'member2@example.com', `email_for_index` = 'member2@example.com', `hashed_password` = '$2a$10$gghXB7RUPpd9nRWSv/OJluDafDgnHTelkKYRyEh0J3Ajg/BiLQONu', `suspended` = 1, `updated_at` = '2014-12-14 08:28:47' WHERE `staff_members`.`id` = 2