baukis-learning/app/controllers/staff/messages_controller.rb

SELECT  `messages`.* FROM `messages`  WHERE `messages`.`id` = 3  ORDER BY `messages`.`created_at` DESC LIMIT 1
---
  def show
    @message = Message.find(params[:id])