app/controllers/staff/accounts_controller.rb

UPDATE `staff_members` SET `email` = 'text@example.com', `email_for_index` = 'text@example.com', `updated_at` = '2014-12-14 08:28:47' WHERE `staff_members`.`id` = 4
---
  def update
    @staff_member = current_staff_member
    @staff_member.assign_attributes(staff_members_params)
    if @staff_member.save