app/controllers/staff/customers_controller.rb

  def index
    @customers = Customer.order(:family_name_kana, :given_name_kana)
      .page(params[:page])
---
SELECT  `customers`.* FROM `customers`   ORDER BY `customers`.`family_name_kana` ASC, `customers`.`given_name_kana` ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `customers`

  def edit
    @customer_form = Staff::CustomerForm.new(Customer.find(params[:id]))
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1

  def create
    @customer_form = Staff::CustomerForm.new
    @customer_form.assign_attributes(params[:form])
    if @customer_form.save
---
INSERT INTO `customers` (`birth_mday`, `birth_month`, `birth_year`, `birthday`, `created_at`, `email`, `email_for_index`, `family_name`, `family_name_kana`, `gender`, `given_name`, `given_name_kana`, `hashed_password`, `updated_at`) VALUES (1, 1, 1970, '1970-01-01', '2015-01-02 03:55:24', 'test@example.jp', 'test@example.jp', '試験', 'シケン', 'female', '花子', 'ハナコ', '$2a$10$qArEoFgyHrgK/Gx3rUXlQ.WlIBHhWgy.0pxDzSG3PdYwXW/QX7C5G', '2015-01-02 03:55:24')

  def update
    @customer_form = Staff::CustomerForm.new(Customer.find(params[:id]))
    @customer_form.assign_attributes(params[:form])
    if @customer_form.save
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
UPDATE `customers` SET `email` = 'test@example.jp', `email_for_index` = 'test@example.jp', `updated_at` = '2014-12-20 13:42:22' WHERE `customers`.`id` = 1