baukis-learning/app/controllers/customer/sessions_controller.rb

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`email_for_index` = 'member1@example.jp' LIMIT 1
---
  def create
    @form = Customer::LoginForm.new(params[:customer_login_form])
    if @form.email.present?
      customer = Customer.find_by(email_for_index: @form.email.downcase)